{
  "intents": [
    {
      "intent": "greet",
      "examples": [
        "Hello",
        "Hi",
        "Hey there",
        "Good morning",
        "Good evening"
      ],
      "responses": [
        "Hello! How can I assist you with the application process today?",
        "Hi there! How can I help you?"
      ]
    },
    {
      "intent": "user_registration",
      "examples": [
        "How do I register?",
        "Where can I create an account?",
        "I want to sign up for the website",
        "How to register for the application?",
        "Tell me the steps for registration"
      ],
      "responses": [
        "To register, Click 'Register' button below login page on the website. Fill in your personal details, set a password, and submit the form. You’ll receive a confirmation email shortly."
      ]
    },
    {
      "intent": "user_login",
      "examples": [
        "How do I log in?",
        "Where is the login page?",
        "I can’t log in",
        "Login steps please",
        "How to access my account?"
      ],
      "responses": [
        "To log in, click on the 'User Login' button on the homepage, enter your registered email and password, and click 'Submit'. If you forgot your password, use the 'Forgot Password' option."
      ]
    },
    {
      "intent": "dashboard_access",
      "examples": [
        "How do I access my dashboard?",
        "Where is my dashboard?",
        "I can’t find the dashboard",
        "Tell me about the dashboard",
        "How to open my user dashboard?"
      ],
      "responses": [
        "You can access your dashboard after logging in. Once logged in, there will be current openings displayed with the application form. Click and fill the details to apply them."
      ]
    },
    {
      "intent": "application_form",
      "examples": [
        "How do I fill the application form?",
        "Where is the application form?",
        "I want to apply for the vacancy",
        "Steps to fill the form",
        "Tell me about the application form"
      ],
      "responses": [
        "To fill the application form, log in to your dashboard and click on 'Application Form'. Complete all required fields, upload the necessary documents, and review before submitting."
      ]
    },
    {
      "intent": "application_success",
      "examples": [
        "How will I know if my application was successful?",
        "Did my application go through?",
        "What happens after I submit my application?",
        "Will I get a confirmation after submitting?"
      ],
      "responses": [
        "After successfully submitting your application, you will see a confirmation message on the website. Additionally, you will receive an acknowledgment email with your application details."
      ]
    },
    {
      "intent": "acknowledgement_template",
      "examples": [
        "What does the acknowledgment template look like?",
        "Will I get a receipt for my application?",
        "Tell me about the acknowledgment email"
      ],
      "responses": [
        "The acknowledgment template includes your application ID, submission date, and other key details. You can download it from your dashboard or check your email for the acknowledgment receipt."
      ]
    },
    {
      "intent": "application_history",
      "examples": [
        "Can I see my previous applications?",
        "Where is my application history?",
        "How to check my old applications?",
        "Tell me about my application records"
      ],
      "responses": [
        "You can view your application history in the 'Application History' section of your dashboard. It contains all your past submissions with their statuses."
      ]
    },
    {
      "intent": "forgot_password",
      "examples": [
        "I forgot my password",
        "How can I reset my password?",
        "What to do if I forget my login details?",
        "I can’t remember my password"
      ],
      "responses": [
        "Click on the 'Forgot Password' link on the login page, enter your registered email address, and follow the instructions sent to your email to reset your password."
      ]
    },
    {
      "intent": "edit_application",
      "examples": [
        "Can I edit my application?",
        "I want to make changes to my form",
        "How do I update my details?",
        "Can I update my application after submission?"
      ],
      "responses": [
        "You can edit your application before the submission deadline. Go to your dashboard, open the application form, make the necessary changes, and save them."
      ]
    },
    {
      "intent": "document_upload",
      "examples": [
        "How do I upload my documents?",
        "Where can I attach my certificates?",
        "I want to upload my educational documents",
        "Steps for document upload"
      ],
      "responses": [
        "You can upload your documents in the 'Document Upload' section of the application form. Ensure the files are in the required format and size."
      ]
    },
    {
      "intent": "track_application",
      "examples": [
        "How do I track my application?",
        "Where can I check the status of my application?",
        "Tell me my application status",
        "How do I know if my application is being processed?"
      ],
      "responses": [
        "To track your application, log in to your dashboard and click on 'Application Status'. You will see the current stage of your application."
      ]
    },
    {
      "intent": "logout",
      "examples": [
        "How do I log out?",
        "Where is the logout button?",
        "I want to log out of my account"
      ],
      "responses": [
        "To log out, click on your profile icon in the top-right corner and select 'Logout'."
      ]
    },
    {
      "intent": "technical_issue",
      "examples": [
        "The website is not working",
        "I can’t upload my documents",
        "I am facing an error on the site",
        "Something is wrong with my dashboard"
      ],
      "responses": [
        "We apologize for the inconvenience. Please try refreshing the page or clearing your browser cache. If the issue persists, contact support at support@rac.gov.in."
      ]
    },
    {
      "intent": "end_conversation",
      "examples": [
        "Thank you",
        "That’s all for now",
        "Goodbye",
        "Thanks for the help"
      ],
      "responses": [
        "You're welcome! Feel free to reach out if you need further assistance. Goodbye!"
      ]
    },
    {
      "intent": "application_status",
      "examples": [
        "current status",
        "application status",
        "latest update",
        "what is next"
      ],
      "responses": [
        "if you have submitted the application, you will get updates of the application status via mail from RAC."
      ]
    },
    {
      "intent": "verification_failed",
      "examples": [
        "there are verification errors in my application",
        "verification of my application failed",
        "input fields don't match with documents",
        "X mark seen / visible in input during verification"
      ],
      "responses": [
        "if you are experiencing 'X' mark in the application during verification, its either due to the mismatch of data in the document to the input or the quality of the document is blurred."
      ]
    },
    {
      "intent": "contact RAC",
      "examples": [
        "how to contact rac",
        "where to contact rac",
        "rac contact number",
        "rac mail id"
      ],
      "responses": [
        "to contact rac, you can click on contact here in the login page to post your queries, or you can reach out t support@rac.gov.in."
      ]
    }
  ]
}